#include<stdio.h>

//输出二维数组的有关数据(地址和值)。

int main()
{
	int a[3][4] = {{32, 3, 43, 76}
			,{3, 7, 5, 9}
			,{4, 54, 65,87}};
	for(int i = 0; i < 3; i++)
	{
		for(int j = 0; j < 4; j++)
		{
			printf("%d\t", *(*(a+i)+j));
		}
		printf("\n");
	}
	printf("a=%o\t*a=%o\t**a=%d\n", a, *a, **a);
	printf("a[0]=%o\t*(a+0)=%o\t*a[0]=%d\t*(a[0]+1)=%d\n", a[0], *(a+0), *a[0], *(a[0]+1));
	printf("&a[0]=%o\t&a[0][0]=%o\ta[0][0]=%d\n", &a[0], &a[0][0], a[0][0]);
	printf("a[1]=%o\ta+1=%o\t*a[1]=%d\t*(a+1)=%o\n", a[1], a+1, *a[1], *(a+1));
	printf("&a[1][0]=%o\t*(a+1)+1=%o\n", &a[1][0], *(a+1)+1);
	printf("a[2]=%o\t*(a+2)+1=%o\t*(a+2)+2=%o\t*(a+2)+3=%o\n", a[2], *(a+2)+1, *(a+2)+2,*(a+2)+3);
	printf("&a[2]=%o\ta+2=%o\n", &a[2], a+2);
	printf("a[1][0]=%d\t*(*(a+1)+0)=%d\n", a[1][0], *(*(a+1)+0));
	printf("*a[2]=%d\t*(*(a+2)+0)=%d\n", *a[2], *(*(a+2)+0));
	return 0;
}
